In [1]:
#import library
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
#import Ta-Feng Grocery with data from 01/11/2000 until 28/02/2001
Tafeng_data = pd.read_csv("/content/sample_data/ta_feng_all_months_merged.csv")
Tafeng_data.head()

  TRANSACTION_DT  CUSTOMER_ID AGE_GROUP  ... AMOUNT  ASSET  SALES_PRICE
0      11/1/2000      1104905     45-49  ...      2   24.0         30.0
1      11/1/2000       418683     45-49  ...      1   48.0         46.0
2      11/1/2000      1057331     35-39  ...      2  142.0        166.0
3      11/1/2000      1849332     45-49  ...      1   32.0         38.0
4      11/1/2000      1981995     50-54  ...      1   14.0         18.0

[5 rows x 9 columns]

In [30]:
Tafeng_data.sample(10)

       TRANSACTION_DT  CUSTOMER_ID AGE_GROUP  ... AMOUNT  ASSET  SALES_PRICE
199229     2000-11-26      1766301     35-39  ...      1   42.0         45.0
409413     2001-01-14      1766554     45-49  ...      2  142.0        158.0
109192     2000-11-14      2098777     60-64  ...      1   57.0         75.0
19762      2000-11-03       937542     40-44  ...      1   23.0         36.0
183899     2000-11-25      1341164     40-44  ...      1   67.0         85.0
376826     2000-12-27      1079982     35-39  ...      1   28.0         27.0
249959     2000-12-09       310918     40-44  ...      2  124.0        132.0
278069     2000-12-06      1803846       <25  ...      3   60.0         75.0
174797     2000-11-24      1113952       >65  ...      1   85.0         99.0
21232      2000-11-03      1783537     25-29  ...      1   60.0         89.0

[10 rows x 9 columns]

In [31]:
Tafeng_data.describe()

        CUSTOMER_ID  PRODUCT_SUBCLASS  ...          ASSET    SALES_PRICE
count  4.424240e+05     442424.000000  ...  442423.000000  442423.000000
mean   1.422972e+06     285117.272824  ...     111.760399     131.267224
std    8.440729e+05     226092.210949  ...     410.465339     438.010664
min    1.069000e+03     100101.000000  ...       0.000000       1.000000
25%    9.914070e+05     110106.000000  ...      34.000000      41.000000
50%    1.596373e+06     130106.000000  ...      61.000000      75.000000
75%    1.860313e+06     520423.000000  ...     110.000000     129.000000
max    2.000200e+07     780510.000000  ...   67872.000000   70589.000000

[8 rows x 6 columns]

In [19]:
#Check for missing values in the dataset
Tafeng_data.isnull().sum(axis=0)

TRANSACTION_DT          0
CUSTOMER_ID             0
AGE_GROUP           12375
PIN_CODE                0
PRODUCT_SUBCLASS        0
PRODUCT_ID              0
AMOUNT                  0
ASSET                   1
SALES_PRICE             1
dtype: int64

In [4]:
#Check the shape (number of columns and rows) in the dataset
Tafeng_data.shape

(442424, 9)

In [17]:
#Customer distribution by age group
age_group_cust_data=Tafeng_data[['AGE_GROUP', 'CUSTOMER_ID']].drop_duplicates()
age_group_cust_data.groupby(['AGE_GROUP'])['CUSTOMER_ID'].aggregate('count').reset_index().sort_values('CUSTOMER_ID', ascending= False)

  AGE_GROUP  CUSTOMER_ID
2     35-39         5069
1     30-34         4531
3     40-44         3882
4     45-49         2835
0     25-29         2437
5     50-54         1662
8       <25         1238
9       >65         1088
6     55-59          837
7     60-64          683

In [27]:
Tafeng_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 442424 entries, 0 to 442423
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   TRANSACTION_DT    442424 non-null  datetime64[ns]
 1   CUSTOMER_ID       442424 non-null  int64
 2   AGE_GROUP         430049 non-null  object
 3   PIN_CODE          442424 non-null  object
 4   PRODUCT_SUBCLASS  442424 non-null  int64
 5   PRODUCT_ID        442424 non-null  int64
 6   AMOUNT            442424 non-null  int64
 7   ASSET             442423 non-null  float64
 8   SALES_PRICE       442423 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 33.8+ MB

In [42]:
numerical_vars = ['TRANSACTION_DT','CUSTOMER_ID', 'AGE_GROUP', 'PIN_CODE', 'PRODUCT_SUBCLASS', 'PRODUCT_ID', 'AMOUNT', 'ASSET', 'SALES_PRICE']

In [36]:
Tafeng_data['SALES_PRICE'].describe()

count    442423.000000
mean        131.267224
std         438.010664
min           1.000000
25%          41.000000
50%          75.000000
75%         129.000000
max       70589.000000
Name: SALES_PRICE, dtype: float64

In [43]:
Tafeng_data['TRANSACTION_DT'].describe()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

count                  442424
unique                     77
top       2000-11-26 00:00:00
freq                    15610
first     2000-11-01 00:00:00
last      2001-01-16 00:00:00
Name: TRANSACTION_DT, dtype: object

In [39]:
Tafeng_data['CUSTOMER_ID'].describe()

count    4.424240e+05
mean     1.422972e+06
std      8.440729e+05
min      1.069000e+03
25%      9.914070e+05
50%      1.596373e+06
75%      1.860313e+06
max      2.000200e+07
Name: CUSTOMER_ID, dtype: float64

In [44]:
#Customer distribution by transaction date
transaction_cust_data=Tafeng_data[['TRANSACTION_DT', 'CUSTOMER_ID']].drop_duplicates()
transaction_cust_data.groupby(['TRANSACTION_DT'])['CUSTOMER_ID'].aggregate('count').reset_index().sort_values('CUSTOMER_ID', ascending= False)

   TRANSACTION_DT  CUSTOMER_ID
25     2000-11-26         1785
24     2000-11-25         1709
11     2000-11-12         1653
46     2000-12-17         1643
74     2001-01-14         1640
..            ...          ...
66     2001-01-06            2
69     2001-01-09            2
63     2001-01-03            1
64     2001-01-04            1
65     2001-01-05            1

[77 rows x 2 columns]

In [45]:
#Remove missing values from CUSTOMER_ID column
#We can ignore missing values in description column
Tafeng_data = Tafeng_data[pd.notnull(Tafeng_data['CUSTOMER_ID'])]

In [46]:
#Check validation, if there are any negative values in AMOUNT column
Tafeng_data.AMOUNT.min()

1

In [47]:
#Check validation, if there are any negative values in SALES_PRICE column
Tafeng_data.SALES_PRICE.min()

1.0

In [48]:
#Filter out data with negative values
Tafeng_data = Tafeng_data[(Tafeng_data["AMOUNT"] > 0)]

In [49]:
#Convert the string date field to datetime
Tafeng_data['TRANSACTION_DT'] = pd.to_datetime(Tafeng_data['TRANSACTION_DT'])